///////////////////////////////////////////////////////////////////////////////
// iLink Btpp Server
//
// 文件名称: messages.cpp
// 功能描述: 消息定义
// 最后修改: 2005-07-15
///////////////////////////////////////////////////////////////////////////////

#include "messages.h"
#include "utilities.h"

///////////////////////////////////////////////////////////////////////////////
// 消息分派函数

//-----------------------------------------------------------------------------
// 描述: 分派 "测试" 消息
//-----------------------------------------------------------------------------
void DispatchTestMessage(int nTestValue)
{
    CTestMessage Message;

    Message.nMessageCode = MC_TEST;
    Message.nTestValue = nTestValue;
    
    GetAppDispatcher()->DispatchMessage(Message);
}

///////////////////////////////////////////////////////////////////////////////
